[
    {
        "name": "Anatomy of the Human Body",
        "numericCode": "100",
        "courseCode": "ANAT",
        "description": "",
        "prerequisite": "",
        "antirequisite": ""
    },
    {
        "subjectId": 1,
        "name": "Engineering Practice l",
        "numericCode": "100",
        "courseCode": "APSC",
        "description": "This course introduces fundamental professional engineering skills and provides an opportunity to apply engineering science and mathematics content in situations emulating professional practice. It consists of three modules: Module 1. Problem analysis and modeling; Module 2. Experimentation and measurement; Module 3: Engineering design. The course provides an introduction to personal learning styles, team dynamics, oral and written presentation skills, laboratory data collection, analysis and presentation, project management, information management, problem analysis and modeling, numeric computation, economics, design methodologies, and workplace safety.",
        "prerequisite": "",
        "antirequisite": ""
    },
    {
        "subjectId": 2,
        "name": "Deleted-General Biochemistry",
        "numericCode": "310",
        "courseCode": "BCHM",
        "description": "Principles of protein biochemistry, enzymology, and protein engineering. Metabolism of carbohydrates, amino acids and lipids. Role of coenzymes. Generation and storage of metabolic energy. Principles of regulatory mechanisms, membrane structure and function, hormone action, and cellular signalling. NOTE: Course weighting is defined by the Faculty of Arts and Science Deleted Nov. 2018",
        "prerequisite": "ENCH 281 (CHEM 281) and CHEM 282, or ENCH 211 (CHEM 211) and ENCH 212 (CHEM 212) and ENCH 245 (CHE",
        "antirequisite": "BCHM 315 , BCHM 316"
    },
    {
        "subjectId": 3,
        "name": "Deleted-Introductory Biology of Cells",
        "numericCode": "102",
        "courseCode": "BIOL",
        "description": "An introduction to the basic themes and concepts of modern biology spanning organizational levels from molecules to cells in an evolutionary context. RECOMMENDATION 4U Biology and Chemistry, or equivalent high school background are highly recommended. NOTE: Course weighting is defined by the Faculty of Arts and Science Nov. 2018",
        "prerequisite": "",
        "antirequisite": ""
    },
    {
        "subjectId": 4,
        "name": "Modeling Techniques in Biology",
        "numericCode": "300",
        "courseCode": "BIOM",
        "description": "Modeling will be presented in the context of biological examples drawn from ecology and evolution, including life history evolution, sexual selection, evolutionary epidemiology and medicine, and ecological interactions. Techniques will be drawn from dynamical systems, probability, optimization, and game theory with emphasis put on how to formulate and analyze models.",
        "prerequisite": "APSC 172 , APSC 174",
        "antirequisite": ""
    },
    {
        "subjectId": 5,
        "name": "Analysis of Process Data",
        "numericCode": "209",
        "courseCode": "CHEE",
        "description": "Statistical methods for analyzing and interpreting process data are discussed, with special emphasis on techniques for continuous improvement of process operations. Topics include: role of data in assessing process operation, identifying major problems, graphical and numerical summaries, principles of valid inference, probability distributions for discrete and continuous data, process capability, comparing process performance to target values, comparing performances of two processes, control charts, and an introduction to linear regression analysis.",
        "prerequisite": "APSC 171 , APSC 172 , APSC 174",
        "antirequisite": "STAT 268, STAT 269, MTHE 367"
    },
    {
        "subjectId": 6,
        "name": "Professional Skills I",
        "numericCode": "200",
        "courseCode": "CIVL",
        "description": "",
        "prerequisite": "",
        "antirequisite": ""
    },
    {
        "subjectId": 7,
        "name": "Logic for Computing Science",
        "numericCode": "204",
        "courseCode": "CMPE",
        "description": "Elements of mathematical logic with computing applications. Formal proof systems for propositional and predicate logic. Interpretations, validity, and satisfiability. Introduction to soundness, completeness and decidability.",
        "prerequisite": "ELEC 270 or CISC 203",
        "antirequisite": ""
    },
    {
        "subjectId": 8,
        "name": "DELETED Introductory Electric Circuits and Machines",
        "numericCode": "210",
        "courseCode": "ELEC",
        "description": "An introductory course for engineering students in disciplines other than electrical or computer engineering. The course begins with a review of the concepts of resistance, capacitance, and inductance. Circuit analysis techniques are then applied to characterize the behaviour of commonly used electrical energy conversion devices such as transformers, dc machines, and induction and synchronous machines. Jan 2019",
        "prerequisite": "APSC 111 , APSC 112 , APSC 171 , APSC 172 , APSC 174",
        "antirequisite": ""
    },
    {
        "subjectId": 9,
        "name": "Main Group Chemistry",
        "numericCode": "211",
        "courseCode": "ENCH",
        "description": "An introduction to chemistry of main group inorganic and organic compounds with the use of fundamental quantum mechanics, molecular orbital diagrams and Lewis structures to describe the structure and bonding. The stereochemistry and chirality of organic compounds, solid-state inorganic chemistry, and descriptive chemistry of compounds of the main group elements will be covered. The laboratory will introduce skills in inorganic and organic synthesis.",
        "prerequisite": "APSC 131 , APSC 132",
        "antirequisite": ""
    },
    {
        "subjectId": 10,
        "name": "Applied Physics",
        "numericCode": "211",
        "courseCode": "ENPH",
        "description": "This course stresses the creation of physical models for real systems. Applications of vibrational motion are developed and a basic description of the properties of elastic media given. The methods required to predict the performance of physical or engineering systems are demonstrated using examples drawn from various fields of science and engineering with emphasis on mechanics and vibrations, waves and optics.",
        "prerequisite": "",
        "antirequisite": ""
    },
    {
        "subjectId": 11,
        "name": "Deleted - History of Life",
        "numericCode": "107",
        "courseCode": "GEOE",
        "description": "The history of life, from its inception four billion years ago to the present day, focusing on the inter-relationship between organic evolution and global change. Coevolution of early life and the atmosphere; development of marine animals and their ecosystems; invasion of the land; dinosaurs and their world; mass extinctions; the Age of Mammals; and hominid evolution. Lectures plus four three-hour laboratories. COURSE DELETED in 2012-2013",
        "prerequisite": "",
        "antirequisite": ""
    },
    {
        "subjectId": 12,
        "name": "Deleted - Resource Engineering",
        "numericCode": "382",
        "courseCode": "GEOL",
        "description": "Characterization of major ore deposit types using petrological, geochemical and geophysical engineering sciences, including tectonic setting, age, rock composition, geometry, mineralogy and textures, geochemical and geophysical signatures of mineral deposits. Design involves evaluation of ore deposit models and exploration programs, including ore processing and environmental issues. Laboratory work integrates investigation of mineral deposit’s samples to determine paragenetic sequences, estimation of ore grade and evaluation of issues related to ore processing and site contamination. COURSE DELETED 2012-2013",
        "prerequisite": "GEOL 235, GEOL 281 or permission of the instructor.",
        "antirequisite": "GEOL 362"
    },
    {
        "subjectId": 13,
        "name": "DELETED - Geographic Information Science",
        "numericCode": "201",
        "courseCode": "GISC",
        "description": "An introduction to the basic principles, techniques, and practical issues in assessing, accessing, and maintaining data sources and database systems and related tools for the manipulation and analysis of data. Students will learn concepts of database management and computer programming and will apply these concepts to the preparation, manipulation, analysis, and presentation of spatial and tabular data. Deleted 2016-2017",
        "prerequisite": "Completion of the First Year Applied Science Program or permission of the Department of Geography",
        "antirequisite": ""
    },
    {
        "subjectId": 14,
        "name": "Arctic and Periglacial Environments",
        "numericCode": "304",
        "courseCode": "GPHY",
        "description": "Advanced study of the physical geography of northern regions, emphasizing the Canadian Arctic.",
        "prerequisite": "",
        "antirequisite": ""
    },
    {
        "subjectId": 15,
        "name": "NOT OFFERED THIS YEAR-Gene Structure and Function (Molecular Biology)",
        "numericCode": "218",
        "courseCode": "MBIO",
        "description": "Molecular mechanisms of gene expression, biochemistry of nucleic acids, chromatin structure, DNA replication, RNA transcription, processing and translation in prokaryotic, eukaryotic and viral systems. Offered jointly by the Departments of Biochemistry, Biology and Microbiology and Immunology.",
        "prerequisite": "BIOL 205",
        "antirequisite": ""
    },
    {
        "subjectId": 16,
        "name": "Deleted - Engineering and Social Justice: Critical Theories of Technological Practices",
        "numericCode": "221",
        "courseCode": "MDEP",
        "description": "This course is intended to help students understand critical theories and to develop critical perspectives towards technology in general and engineering practices in particular and draws from sociology, history, political economics, science and technology studies and philosophy. The course is cross-disciplinary in its approach and will explore the relationship between technology, labour, industry, society, and the natural world. Students will reflect on notions of rights, justice, freedom and sustainability in human and non human arenas.",
        "prerequisite": "",
        "antirequisite": "SOCY 234"
    },
    {
        "subjectId": 17,
        "name": "Mathematical and Computational Tools for Mechanical Engineers I",
        "numericCode": "202",
        "courseCode": "MECH",
        "description": "This course will provide students with an introduction to vector calculus, analytical, and numerical solution methods for ordinary differential equations. The topics of the course will be prresented through problems, models and applications relevant to the Mechanical Engineering Program. On completion of the course students will be able to: manipulate vectors; perform numerical integration; solve first- and higher-order ordinary differential equations analytically and numerically. Students will solve problems analytically and computationally in an active learning, tutorial environment.",
        "prerequisite": "APSC 111 , APSC 143 or MNTC 313 , APSC 171 , APSC 172 and APSC 174",
        "antirequisite": "MTHE 225 , MATH 225 and MTHE 272"
    },
    {
        "subjectId": 18,
        "name": "Immunology",
        "numericCode": "360",
        "courseCode": "MICR",
        "description": "The general principles and mechanism of immune reaction. Immunochemical and immunobiological aspects of antibody formation and cell-mediated immunity in health and disease will be considered.",
        "prerequisite": "",
        "antirequisite": ""
    },
    {
        "subjectId": 19,
        "name": "NOT OFFERED 2020-2021 Applied Rock Mechanics (changing from MINE 225)",
        "numericCode": "325",
        "courseCode": "MINE",
        "description": "This course deals with the principles of solid mechanics as applied to geologic materials in order to examine the effects of stress, strain and other factors on the geomechanical responses of such materials to these influences. Topics covered include rheological behaviour of rocks, stress measurement and prediction, and measurement procedures for determination of rock strength and other characteristic parameters. Failure theories are discussed and used to describe fracture development and design considerations for underground and surface mine structures. Analytical techniques based on empirical knowledge and supported by available theory and engineering practice are presented, including, for example: slope stability, underground structure and rock foundation design; the influences of ground water, rockbursts and backfill support on structural stability of excavations; and discussion of potential hazards associated with each. The operation and design of instrumentation used for rock mechanics studies are also discussed.",
        "prerequisite": "CIVL 230 and MINE 202 or permission of the instructor",
        "antirequisite": ""
    },
    {
        "subjectId": 20,
        "name": "Engineering Mathematics",
        "numericCode": "P01",
        "courseCode": "MNTC",
        "description": "This course provides a detailed introduction to the fundamentals of calculus and linear algebra as applied to engineering applications. The purpose of the course is to provide a mathematical foundation for students pursuing upper-year engineering-related courses. The course covers topics such as derivatives, implicit differentiation, partial derivatives, integrals, first-order and higher-order linear ordinary differential equations, fundamentals of Laplace transforms, matrices and matrix inverses, solving systems of linear equations, vector spaces, orthogonality, and determinants. Topics are introduced by way of engineering examples. Available Online.",
        "prerequisite": "MNTC P03 and MNTC P04",
        "antirequisite": ""
    },
    {
        "subjectId": 21,
        "name": "Linear Algebra",
        "numericCode": "212",
        "courseCode": "MTHE",
        "description": "Vector spaces, direct sums, linear transformations, eigenvalues, eigenvectors, inner product spaces, self-adjoint operators, positive operators, singular-value decomposition, minimal polynomials, Jordan canonical form, the projection theorem, applications to approximation and optimization problems.",
        "prerequisite": "APSC 174",
        "antirequisite": "MTHE 312 (MATH 312)"
    },
    {
        "subjectId": 22,
        "name": "Software Requirements",
        "numericCode": "423",
        "courseCode": "SOFT",
        "description": "An integrated approach to discovering and documenting software requirements. Identification of stakeholders; customer, operator, analyst, and developer perspectives. Requirements elicitation. Transition from initial (informal) requirements to semi-formal and formal representations. Requirements analysis process; analysis patterns. Requirements specification techniques. Relation to architecture and user interface design; traceability of requirements. Alternately offered as CISC 423.",
        "prerequisite": "CMPE 223 COREQUISITE(S): CMPE 322",
        "antirequisite": "CISC 423"
    },
    {
        "subjectId": 23,
        "name": "Real Estate Planning and Development",
        "numericCode": "844",
        "courseCode": "SURP",
        "description": "This course examines real estate market research, project planning finance and development techniques. Residential, retail and office market analysis and development are studies through lectures and case study discussions. Learning materials approx. $24.",
        "prerequisite": "Permission of the instructor",
        "antirequisite": ""
    }
]